# import modules

In [20]:
from pandas import read_csv
import pandas as pd

# read the csv file

In [21]:
filename = 'daily_retail_price_Onion-upto_apr_2015.csv'
header_names = ['Date','Centre_Name','Commodity_Name','Price']
onion = read_csv(filename,names = header_names)

# display the data

In [22]:
onion

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

# interchanging columns

In [23]:
titles = list(onion.columns)
titles #titles is a list of strings

['Date', 'Centre_Name', 'Commodity_Name', 'Price']

In [24]:
titles[1], titles[2] = titles[2], titles[1]
titles

['Date', 'Commodity_Name', 'Centre_Name', 'Price']

In [25]:
onion = onion[titles]
onion

            Date Commodity_Name      Centre_Name  Price
0       25-11-97          Onion            DELHI    8.0
1       25-11-97          Onion           SHIMLA    7.0
2       25-11-97          Onion          LUCKNOW    5.0
3       25-11-97          Onion        AHMEDABAD    6.0
4       25-11-97          Onion           BHOPAL    8.0
...          ...            ...              ...    ...
127906  28-04-15          Onion         DINDIGUL   18.0
127907  28-04-15          Onion  THIRUCHIRAPALLI   18.0
127908  28-04-15          Onion       COIMBATORE   18.0
127909  28-04-15          Onion      TIRUNELVELI   18.0
127910  28-04-15          Onion        HYDERABAD   22.0

[127911 rows x 4 columns]

# creating a new column and inserting in to the data

In [26]:
# Import pandas package 
import pandas as pd 

# Define a dictionary containing Students data 
data = {'Name': ['Ravi', 'Kavitha', 'Gaurav', 'Dharmendar'], 'Height': [5.1, 6.2, 5.1, 5.2], 'Qualification': ['Msc', 'MA', 'Msc', 'Msc']} 

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 
print(df)
# Using DataFrame.insert() to add a column 
df.insert(2, "Age", [21, 23, 24, 21], True)

# Observe the result 
df

         Name  Height Qualification
0        Ravi     5.1           Msc
1     Kavitha     6.2            MA
2      Gaurav     5.1           Msc
3  Dharmendar     5.2           Msc

         Name  Height  Age Qualification
0        Ravi     5.1   21           Msc
1     Kavitha     6.2   23            MA
2      Gaurav     5.1   24           Msc
3  Dharmendar     5.2   21           Msc

In [27]:
# Import pandas package 
import pandas as pd 

# Define a dictionary containing Students data 
data = {'Name': ['Ravi', 'Kavitha', 'Gaurav', 'Dharmendar'], 'Height': [5.9, 5.4, 5.9, 6.0], 'Qualification': ['BE', 'ME', 'B.Tech', 'Msc']} 

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 
df2 = df.assign(address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']) 
df2

         Name  Height Qualification    address
0        Ravi     5.9            BE      Delhi
1     Kavitha     5.4            ME  Bangalore
2      Gaurav     5.9        B.Tech    Chennai
3  Dharmendar     6.0           Msc      Patna

# overwriting columns

In [28]:
from numpy import array
from numpy import argmax
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder

In [29]:
headers_name=['a','b','c','d','e']
data=read_csv("iris.csv",names=headers_name)
print(data.head())
x=array(data['e'])
label_encoder = LabelEncoder()
data['e'] = label_encoder.fit_transform(x)
# print(integer_encoded)
print(data)

     a    b    c    d            e
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
       a    b    c    d  e
0    5.1  3.5  1.4  0.2  0
1    4.9  3.0  1.4  0.2  0
2    4.7  3.2  1.3  0.2  0
3    4.6  3.1  1.5  0.2  0
4    5.0  3.6  1.4  0.2  0
..   ...  ...  ...  ... ..
145  6.7  3.0  5.2  2.3  2
146  6.3  2.5  5.0  1.9  2
147  6.5  3.0  5.2  2.0  2
148  6.2  3.4  5.4  2.3  2
149  5.9  3.0  5.1  1.8  2

[150 rows x 5 columns]